Repository: KarlYu130/Patient-Health-Record-App
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: SIGHT Patient Records
si: SIGHT රෝගී වාර්තා
ta: SIGHT நோயாளி பதிவுகள்

# noPatients
source: No patients available.
si: රෝගීන් නොමැත.
ta: நோயாளிகள் இல்லை.

source: Add Patient
si: රෝගියා එක් කරන්න
ta: புதிய நோயாளியை சேர்க்கவும்

source: Delete
si: මකන්න
ta: நீக்கவும்

# scanQR
source: Scan QR Code
si: QR කේතය ස්කෑන් කරන්න
ta: QR கோடு சுட்டி

source: Language
si: භාෂාව
ta: மொழி

source: English
si: ඉංග්‍රීසිය
ta: ஆங்கிலம்

source: Sinhala
si: සිංහල
ta: சிங்களம்

source: Tamil
si: තමිලා
ta: தமிழ்

source: Submit
si: ඉදිරිපත් කරන්න
ta: சமர்ப்பிக்கவும்

source: Update
si: යාවත්කාලීන කරන්න
ta: புதுப்பிக்கவும்

source: Health Record Details
si: සෞඛ්‍ය වාර්තා විස්තර
ta: சுகாதார பதிவுகளின் விவரங்கள்

source: Edit Health Record
si: සෞඛ්‍ය වාර්තාව සංස්කරණය කරන්න
ta: சுகாதார பதிவைத் திருத்தவும்

# chatWithDoctor
source: Chat with AI Doctor
si: AI වෛද්‍යයා සමඟ කතා කරන්න
ta: AI மருத்துவருடன் உரையாடவும்

source: Add Health Record
si: සෞඛ්‍ය වාර්තාවක් එක් කරන්න
ta: சுகாதார பதிவைச் சேர்க்கவும்

source: Name
si: නම
ta: பெயர்

source: Enter Patient Name
si: රෝගියාගේ නම ඇතුල් කරන්න
ta: நோயாளியின் பெயரை உள்ளிடவும்

source: Sex
si: ලිංගය
ta: பாலினம்

source: Age
si: වයස
ta: வயது

source: Condition
si: තත්ත්වය
ta: நிலை

source: Add Image
si: පින්තූර එක් කරන්න
ta: படத்தைச் சேர்க்கவும்

source: Type Your Message
si: ඔබගේ පණිවිඩය.type කරන්න
ta: உங்கள் செய்தியை வகைப்படுத்தவும்

source: Send
si: යවන්න
ta: அனுப்பு

source: Recorded On
si: සටහන් කර ඇත
ta: பதிவான தேதி

source: Body Temperature
si: ශරීර උෂ්ණත්වය
ta: உடல் வெப்பநிலை

source: Not Available
si: ලබා ගත නොහැක
ta: கிடைக்கவில்லை

source: Blood Pressure
si: අච්චු පීඩනය
ta: ரத்த அழுத்தம்

source: Blood Glucose Level
si: රුධිර ග්ලූකෝස් මට්ටම
ta: ரத்த சர்க்கரை அளவு

source: Blood Oxygen Level
si: රුධිර ඔක්සිජන් මට්ටම
ta: ரத்த ஆக்சிஜன் அளவு

source: Heart Rate
si: හදවතේ ගතිය
ta: இதயத் துடிப்பு

source: Risk Assessment
si: සංක්‍රාන්ති ඇගයීම
ta: ஆபத்த்த் மதிப்பீடு

source: Diabetes Risk
si: මधुमेह ගිර්හණය
ta: நரம்புற்றுப்பானினிய ஆபத்து

source: Hypertension Risk
si: උච්ච රුධිර පීඩන ගිර්හණය
ta: உயர் ரத்த அழுத்த ஆபத்து

source: Health Metrics Chart
si: සෞඛ්‍ය මොනි���රින් වාර්තාව
ta: ஆரோக்கிய அளவீட்டொகை வரைபடம்

source: Health Metrics Overview
si: සෞඛ්‍ය මොනිටරින් සාරාංශය
ta: ஆரோக்கிய அளவீட்டொகை மேலோட்டம்

source: Values
si: මිල
ta: மதிப்புகள்

# bodyTemperatureC
source: Body Temperature (Â°C)
si: ශරීර උෂ්ණත්වය (°C)
ta: உடல் வெப்பநிலை (°C)

source: Systolic BP (mmHg)
si: සයිස්ටොලික් BP (mmHg)
ta: சிஸ்டோலிக் BP (mmHg)

source: Diastolic BP (mmHg)
si: ඩයස්ටොලික් BP (mmHg)
ta: டயஸ்டோலிக�� BP (mmHg)

# bloodGlucoseMgDl
source: Blood Glucose Level (mg/dL)
si: රුධිර ග්ලූකෝස් මට්ටම (mg/dL)
ta: ரத்த சர்க்கரை அளவு (mg/dL)

source: Heart Rate (bpm)
si: හදවතේ ගතිය (bpm)
ta: இதயத் துடிப்பு (bpm)

source: Add Record
si: වාර්තාව එක් කරන්න
ta: பதிவைச் சேர்க்கவும்

source: Update Record
si: වාර්තාව යාවත්කාලීන කරන්න
ta: பதிவை மேம்படுத்தவும்

source: Edit Patient
si: රෝගියා සංස්කරණය කරන්න
ta: நோயாளியைத் திருத்தவும்

source: Patient Details
si: රෝගියගේ විස්තර
ta: நோயாளி விவரங்கள்

source: Health Records
si: සෞඛ්‍ය වාර්තා
ta: சுகாதார பதிவுகள்

source: Chat with AI Doctor
si: AI වෛද්‍ය සමඟ කතා කරන්න
ta: AI மருத்துவருடன் உரையாடவும்

source: Generate PDF
si: PDF ජනනය කරන්න
ta: PDF உருவாக்கவும்

source: Health Trends
si: සෞඛ්‍ය ප්‍රවණතා
ta: சுகாதார போக்குகள்

source: Health Metrics Over Time
si: කාලය සමඟ සෞඛ්‍ය මැතිරික්ස්
ta: காலத்தால் சுகாதார முறைமைகள்

source: Systolic BP
si: සයිස්ටොලික් රුධිර පීඩනය
ta: சிஸ்டோலிக் இரத்த அழுத்தம்

source: Diastolic BP
si: ඩයස්ටොලික් රුධිර පීඩනය
ta: டயஸ்டோலிக் இரத்த அழுத்தம்

source: Blood Glucose
si: රුධිර ග්ලූකෝස්
ta: இரத்தச் சர்க்கரை

source: No health records available.
si: සෞඛ්‍ය වාර්තා නොමැත.
ta: சுகாதார பதிவுகள் கிடைக்கவில்லை.

source: Delete Record
si: වාර්තාව මකන්න
ta: பதிவை நீக்கவும்

# deleteRecordConfirmation
source: Are you sure you want to delete this health record?
si: ඔබට මෙම සෞඛ්‍ය වාර්තාව මකා දමන්න хүсද?
ta: இந்த சுகாதார பதிவை நீக்க விழைகிறீர்களா?

source: Cancel
si: අවලංගු කරන්න
ta: ரத்து செய்

# validOxygenLevel
source: Please enter a valid oxygen level.
si: කරුණාකර වලංගු ඔක්සිජන් මට්ටමක් ඇතුල් කරන්න.
ta: சரியான ஆக்சிஜன் மட்டத்தை உள்ளிடவும்.

# validHeartRate
source: Please enter a valid heart rate.
si: කරුණාකර වලංගු හදවතේ ගතියක් ඇතුල් කරන්න.
ta: சரியான இதய துடிப்பு எண்ணிக்கையை உள்ளிடவும்.

source: Add
si: එකතු කරන්න
ta: சேர்

source: Male
si: පුරුෂ
ta: ஆண்

source: Female
si: ගැහැණු
ta: பெண்
